[
  {
    "id": 1,
    "title": "My Journey into Web Development",
    "excerpt": "How I went from watching YouTube tutorials to building real projects as a 12-year-old developer.",
    "content": [
      "Starting my coding journey at a young age has been an incredible adventure. It all began with simple curiosity and YouTube tutorials that opened up a whole new world of possibilities.",
      "My journey began when I stumbled upon programming tutorials on YouTube. What started as simple curiosity quickly turned into hours of learning and experimenting. The first 'Hello World' program I wrote felt like magic - I was actually talking to the computer!",
      "From there, I dove deeper into web technologies. HTML and CSS came first, allowing me to create my first web pages. Then JavaScript opened up a whole new world of interactivity. Each new concept I learned felt like unlocking a new superpower.",
      "The most challenging part wasn't learning the syntax or understanding the concepts - it was building the confidence to create real projects. But with each small project, from simple calculators to interactive games, I grew more confident in my abilities.",
      "Learning from amazing YouTubers like Bro Code and Dave Gray made complex concepts feel achievable. Their clear explanations and hands-on approach helped me understand not just the 'how' but also the 'why' behind programming concepts.",
      "Today, I'm working with modern frameworks like React and Next.js, building full-stack applications, and constantly learning new technologies. The journey from watching tutorials to building real projects has taught me that age is just a number when it comes to coding - passion and persistence are what truly matter.",
      "My advice to other young developers: start small, be consistent, and don't be afraid to make mistakes. Every error is a learning opportunity, and every project, no matter how simple, is a step forward in your coding journey."
    ],
    "date": "2025-10-19",
    "readTime": "5 min read",
    "tags": [
      "Web Development",
      "Learning",
      "Journey"
    ],
    "image": "/blog1.png",
    "featured": true
  },
  {
    "id": 2,
    "title": "Why I Built This Portfolio",
    "excerpt": "The story behind creating my personal portfolio website and what I learned in the process.",
    "content": [
      "Building this portfolio wasn't just about showcasing my projects - it was about proving to myself that I could create something professional and polished from scratch.",
      "As a 12-year-old developer, I often felt like I needed to prove that my age doesn't define my capabilities. This portfolio became my way of demonstrating that young developers can create high-quality, professional work that stands on its own merit.",
      "I wanted to create more than just a simple website. I envisioned a platform that would tell my story, showcase my technical skills, and connect with other developers and potential collaborators. Every animation, every interaction, and every design choice was intentional.",
      "The technical challenges were exciting. I used Next.js for the framework, TypeScript for type safety, and Tailwind CSS for styling. Implementing features like the contact form with Nodemailer, rate limiting, and responsive design taught me so much about full-stack development.",
      "One of my favorite features is the interactive tic-tac-toe game that opens right in the portfolio. It shows visitors that I can build engaging, functional applications while keeping them entertained. It's a perfect blend of showcasing technical skills and creating a memorable user experience.",
      "The blog section you're reading right now was another important addition. I wanted a space to share my thoughts, document my learning journey, and connect with the developer community. Writing about my experiences helps me reflect on how far I've come.",
      "This portfolio represents more than just code - it's a statement that passion and dedication matter more than age. It's my digital handshake with the world, showing that young developers can contribute meaningfully to the tech community.",
      "Building this portfolio taught me that creating something you're proud of takes time, patience, and attention to detail. But the satisfaction of seeing your vision come to life makes every challenge worth it."
    ],
    "date": "2025-10-19",
    "readTime": "4 min read",
    "tags": [
      "Portfolio",
      "Personal Project",
      "Reflection"
    ],
    "image": "/blog2.png",
    "featured": false
  }
]